smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
// ============================================================
// NOTE / LOGIC - WIFI UPDATE
// 1) BOOT: chỉ thử kết nối Wi-Fi đã lưu trong 10 giây.
//    Nếu thất bại -> chạy Offline. KHÔNG tự phát AP cấu hình.
// 2) Chỉ khi user vào Function -> Wifi Setting:
//    ESP32 mới phát AP "ATE_Setup_WiFi", IP 192.168.4.1.
// 3) Wifi Setting KHÔNG timeout; portal chạy non-blocking.
// 4) Trong Wifi Setting, nhấn OK -> hỏi "Exit WiFi Setting?".
//    Dùng DOWN chọn No/Yes, nhấn OK để xác nhận.
//    Mặc định chọn No để tránh thoát nhầm.
// 5) Khi user cấu hình Wi-Fi mới thành công -> hiện "WiFi Updated!"
//    và ESP32 tự reboot.
// 6) Khi phone mở http://192.168.4.1, portal tự chuyển thẳng đến
//    http://192.168.4.1/wifi để hiện list Wi-Fi; bỏ qua trang Home
//    có nút "Configure WiFi" (tránh browser tự đổi link sang HTTPS).
// ============================================================
// 7) LOCAL LITTLEFS OTA SAFE:
//    - PlatformIO uploadfs qua espota được nhận diện riêng với firmware OTA.
//    - Audio task dừng và đóng WAV trước khi LittleFS.end().
//    - OTA thành công -> ArduinoOTA tự reboot; setupAudio() mount lại LittleFS.
//    - OTA filesystem lỗi -> thử remount LittleFS không format và resume audio.
// 8) HTTPS OTA FW + LITTLEFS:
//    - version.json quản lý độc lập firmware và filesystem.
//    - Firmware mới được update trước, chưa reboot ngay.
//    - LittleFS mới: dừng audio -> đóng WAV -> LittleFS.end() -> update image.
//    - Chỉ reboot một lần sau khi các update cần thiết hoàn tất.
//    - Version filesystem đã cài được lưu trong EEPROM để không download lại mỗi boot.
// 9) WEB UI V1 (LOCAL):
//    - Web chạy trực tiếp trên ESP32-S3, truy cập qua http://<ATE-IP>/.
//    - Static files nằm trong LittleFS: /web/index.html, /web/style.css, /web/app.js.
//    - Dashboard realtime bằng REST polling, không dùng thư viện web ngoài.
//    - Control web bị chặn khi Automation đang chạy đối với thao tác hardware manual.
//    - Khi LittleFS OTA: WebServer dừng trước LittleFS.end(), reboot/remount an toàn.
// ============================================================

#include <Arduino.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <ESP32Servo.h>        
#include <EEPROM.h>            
#include <Adafruit_MCP23X17.h> 
#include "USB.h" 

// ==========================================
// THƯ VIỆN & CẤU HÌNH WIFI / LOCAL OTA / HTTPS OTA
// ==========================================
#include <WiFi.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>         // Cho Local OTA
#include <WiFiClientSecure.h>   // Cho HTTPS OTA
#include <HTTPClient.h>
#include <HTTPUpdate.h>
#include <Update.h>             // U_LITTLEFS / filesystem OTA target
#include <ArduinoJson.h>        // Đọc file version.json
#include <WiFiManager.h>        // THƯ VIỆN WIFIMANAGER
#include <WebServer.h>           // Web UI local - built-in Arduino-ESP32 2.0.17

// ==========================================
// AUDIO - MAX98357A / I2S / LITTLEFS
// ==========================================
#include <driver/i2s.h>  // Arduino-ESP32 2.0.17 / ESP-IDF 4.4 legacy I2S driver
#include <LittleFS.h>
#include <FS.h>
#include <math.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>

// Thông số cho HTTPS OTA (Kiểm tra phiên bản)
// VERSION_NAME: chỉ dùng để hiển thị cho người dùng.
// VERSION_CODE: dùng để so sánh OTA, tuyệt đối không dùng float.
//
// Quy ước VERSION_NAME -> VERSION_CODE:
// Ví dụ:
//   02.01.01  -> 20101
//   02.01.02  -> 20102
//   10.08.01  -> 100801

const char* CURRENT_VERSION = "04.00.01";
const uint32_t CURRENT_VERSION_CODE = 40001;

// Filesystem version KHÔNG thể chỉ dùng const trong firmware, vì LittleFS có thể
// được update độc lập với firmware. Giá trị thực tế đã cài sẽ được lưu EEPROM.
// 0 = chưa biết/chưa từng sync HTTPS; lần đầu có Wi-Fi sẽ sync theo version.json.
const uint32_t FACTORY_FS_VERSION_CODE = 0;
uint32_t installedFsVersionCode = FACTORY_FS_VERSION_CODE;

const char* version_url = "https://smartcartech.vn/ate-automation/firmware/version.json"; 
const char* base_bin_url = "https://smartcartech.vn/ate-automation/firmware/";


// ==========================================
// WEB UI V1 - LOCAL CONTROL / DASHBOARD
// ==========================================
// Web UI chạy trên ESP32 trong LAN. smartcartech.vn chỉ dùng làm OTA server.
// Truy cập: http://<IP-hiển-thị-trên-LCD>/ hoặc http://ate-tool-system.local/
const char* ATE_STATION_NAME = "ATE-01";
const uint16_t ATE_WEB_PORT = 80;

WebServer ateWeb(ATE_WEB_PORT);
bool webRoutesConfigured = false;
bool webServerStarted = false;

enum WebPendingAction : uint8_t {
  WEB_ACTION_NONE = 0,
  WEB_ACTION_START_WIFI_PORTAL,
  WEB_ACTION_HTTPS_OTA
};

volatile WebPendingAction pendingWebAction = WEB_ACTION_NONE;
unsigned long pendingWebActionMillis = 0;
const uint32_t WEB_DEFERRED_ACTION_DELAY_MS = 400UL;

const char WEB_FALLBACK_HTML[] PROGMEM = R"HTML(
<!doctype html><html><head><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>ATE Automation</title><style>body{font-family:Arial,sans-serif;background:#111827;color:#f9fafb;margin:0;padding:28px}main{max-width:720px;margin:auto;background:#1f2937;padding:24px;border-radius:16px}code{background:#111827;padding:2px 6px;border-radius:6px}.ok{color:#34d399}</style></head>
<body><main><h2>ATE Automation Web</h2><p>ESP32 WebServer is running, but the LittleFS web assets are not available.</p><p>Put the files in <code>data/web/</code>, build the complete LittleFS image (including <code>data/voice/</code>), then upload/update the filesystem.</p><p class="ok">API status is still available at <code>/api/status</code>.</p></main></body></html>
)HTML";

// Tự tay khai báo cổng USB Serial
USBCDC USBSerial;

// Khởi tạo LCD 20x4 (Địa chỉ 0x27)
LiquidCrystal_I2C lcd(0x27, 20, 4); 

// Khởi tạo chip mở rộng MCP23017 
Adafruit_MCP23X17 mcp;

// ==========================================
// CẤU HÌNH ĐA TRẠM (3 CẶP USB - DLC)
// ==========================================
Servo usbServos[3];
const int USB_SERVO_PINS[3] = {47, 21, 14}; 
const int DLC_RELAY_PINS[3] = {11, 12, 13};
int currentPair = 0; 

// ==========================================
// ĐỊNH NGHĨA CHÂN GIAO TIẾP VÀ NÚT NHẤN
// ==========================================
#define I2C_SDA_PIN 4  
#define I2C_SCL_PIN 5  

const int BTN_OK    = 1;  
const int BTN_DOWN  = 2;  
const int BTN_PLUS  = 42; 
const int BTN_MINUS = 41; 
const int BTN_RUN   = 40; 

// ==========================================
// CẤU HÌNH AUDIO - MAX98357A + LOA 3W
// ==========================================
// MAX98357A:
//   BCLK -> GPIO15
//   LRC/WS -> GPIO16
//   DIN -> GPIO17
//   VIN -> 5V
//   GND -> GND
//   SPK+ / SPK- -> 2 chân loa (KHÔNG nối SPK- xuống GND)
const int I2S_BCLK_PIN = 15;
const int I2S_LRC_PIN  = 16;
const int I2S_DOUT_PIN = 17;

const uint32_t BUTTON_BEEP_SAMPLE_RATE = 16000;
const uint16_t BUTTON_BEEP_FREQ_HZ     = 2200;
const uint16_t BUTTON_BEEP_DURATION_MS = 60;
const int16_t  BUTTON_BEEP_AMPLITUDE   = 5200; // ~16% full scale, đủ nghe nhưng không quá gắt
const uint8_t  VOICE_VOLUME_PERCENT    = 75;   // chỉnh 0..100 nếu muốn nhỏ/lớn hơn

// Voice files trong LittleFS.
// Yêu cầu file: WAV PCM, 16-bit, MONO. Sample rate 8..96 kHz; I2S tự đổi clock theo WAV.
const char* VOICE_SYSTEM_READY       = "/voice/system_ready.wav";
const char* VOICE_AUTO_WITH_KEY      = "/voice/auto_with_key.wav";
const char* VOICE_AUTO_SKIP_KEY      = "/voice/auto_skip_key.wav";
const char* VOICE_TOOL_1             = "/voice/tool_1.wav";
const char* VOICE_TOOL_2             = "/voice/tool_2.wav";
const char* VOICE_TOOL_3             = "/voice/tool_3.wav";
const char* VOICE_WIFI_FAILED        = "/voice/wifi_failed.wav";
const char* VOICE_OTA_FAILED         = "/voice/ota_failed.wav";
const char* VOICE_HARDWARE_ERROR     = "/voice/hardware_error.wav";
const char* VOICE_AUTOMATION_STOPPED = "/voice/automation_stopped.wav";

