smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
const i2s_port_t AUDIO_I2S_PORT = I2S_NUM_0;
QueueHandle_t audioBeepQueue = nullptr;
QueueHandle_t audioVoiceQueue = nullptr;
TaskHandle_t audioTaskHandle = nullptr;
bool audioI2SReady = false;
bool audioFSReady = false;

// ==========================================
// TRẠNG THÁI AUDIO / LITTLEFS KHI LOCAL OTA
// ==========================================
// Khi upload filesystem qua PlatformIO (pio run -t uploadfs), ArduinoOTA
// sẽ báo command khác U_FLASH. Ta yêu cầu audio task dừng cooperative,
// đóng file WAV đang đọc rồi mới LittleFS.end() để tránh ghi đè filesystem
// trong lúc audio vẫn còn giữ file mở.
volatile bool audioFsOtaPauseRequested = false;
volatile bool audioFsOtaPaused = false;
volatile bool localOtaInProgress = false;
volatile bool localOtaFilesystemUpdate = false;
const uint32_t AUDIO_FS_OTA_PAUSE_TIMEOUT_MS = 2000UL;

// ==========================================
// BIẾN CHO CHƯƠNG TRÌNH CHÍNH 
// ==========================================
int usbAngleA[3]; 
int usbAngleB[3]; 
int delayDisconnect; 
int delayConnect; 

const int addrUsbA[3] = {0, 8, 16};
const int addrUsbB[3] = {4, 12, 20};
const int addrTimeD   = 24; 
const int addrTimeC   = 28; 

// EEPROM metadata cho version LittleFS HTTPS OTA.
// Các địa chỉ cũ 0..31 giữ nguyên hoàn toàn.
const int addrFsVersionCode  = 32;
const int addrFsVersionMagic = 36;
const uint32_t FS_VERSION_MAGIC = 0x46535631UL; // ASCII gần tương đương "FSV1"

int currentScreen = 1; 
int cursorIndex = 0; 
bool isRunning = false;
bool isRunManually = false; 
bool skipManualKeyTest = false; // false = AUTO (test 11 keys), true = AUTO2 (skip key test)
unsigned long previousMillis = 0;
int runStep = 6; // Mặc định chạy ở Step 6 (Chờ PC Command)

bool lastOk = HIGH, lastDown = HIGH, lastPlus = HIGH, lastMinus = HIGH, lastRun = HIGH;

// ==========================================
// BIẾN CHO WIFI SETTING (CONFIG PORTAL KHÔNG BLOCKING)
// ==========================================
// WiFiManager chỉ mở AP cấu hình khi user chủ động vào "Wifi Setting".
// Khi BOOT thất bại, ESP32 KHÔNG tự phát AP cấu hình.
WiFiManager wifiManager;
bool wifiPortalActive = false;
bool wifiExitConfirm = false;
int wifiExitSelection = 0; // 0 = No (mặc định an toàn), 1 = Yes

// JavaScript được WiFiManager chèn vào <head> của portal.
// Chỉ redirect khi đang ở trang root "/"; trang /wifi sẽ không redirect tiếp,
// vì vậy không tạo vòng lặp. Dùng URL tuyệt đối HTTP để tránh browser
// tự nâng link Configure WiFi thành HTTPS.
const char WIFI_PORTAL_DIRECT_WIFI_PAGE[] =
  "<script>"
  "if(window.location.pathname==='/' ){"
  "window.location.replace('http://192.168.4.1/wifi');"
  "}"
  "</script>";

const unsigned long WIFI_BOOT_CONNECT_TIMEOUT_MS = 10000UL; // Chỉ chờ Wi-Fi cũ 10 giây khi BOOT

// Khai báo trước hàm
void printCentered(int row, String text);
void drawScreen();
void handleRunSequence();
void handleSerialCommands();
void trigger11Keys();
void detachServoSafe(int index);
void safeStopAll(); 
void updateFirmwareFromInternet(); // HTTPS OTA: Firmware + LittleFS
void setupArduinoOTA();
void startWifiSettingPortal();
void stopWifiSettingPortalAndReturn();
void drawWifiSettingScreen();
void drawWifiExitConfirmScreen();

// Web UI V1
void setupAteWebServer();
void stopAteWebServer();
void configureAteWebRoutes();
void processPendingWebAction();
void serveAteWebFile(const char* path, const char* contentType);
void sendWebJson(int httpCode, JsonDocument& doc);
void sendWebMessage(int httpCode, const char* status, const char* message);
bool parseWebJson(JsonDocument& doc);
bool webManualControlAllowed();
String webModeName();
String webStepName();
bool fetchOtaManifestForWeb(String& fwVersion, uint32_t& fwCode, String& fsVersion, uint32_t& fsCode, String& errorText);
void webStartPcMode();
void webStartManualMode(bool skipKeyTest);
void webStopAutomation();

// Audio
void setupAudio();
void audioTask(void* parameter);
void requestButtonBeep();
void queueVoice(const char* filePath);
void queueToolVoice(int toolIndex);
void playButtonBeepInternal();
bool playVoiceWavInternal(const char* filePath);
bool parseWavHeader(File& file, uint32_t& sampleRate, uint16_t& channels, uint16_t& bitsPerSample, uint32_t& dataSize);
uint16_t readLE16(const uint8_t* p);
uint32_t readLE32(const uint8_t* p);
bool pauseAudioAndUnmountLittleFSForOta();
void resumeAudioAfterFilesystemOtaError();
void writeAudioSilence();

// HTTPS OTA / filesystem version metadata
void loadInstalledFsVersion();
void saveInstalledFsVersion(uint32_t versionCode);
String versionCodeToName(uint32_t versionCode);

void setup() {
  USB.VID(0x1720); 
  USB.PID(0xAE01); 
  USB.productName("ATE Test System"); 
  USB.manufacturerName("INNOVA Automation");
  USB.firmwareVersion(0x100); 
  
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  for (int i = 0; i < 3; i++) {
    usbServos[i].setPeriodHertz(50); 
  }

  USBSerial.begin(115200); 
  USB.begin();

  // Khởi tạo I2S + LittleFS + audio task trước MCP23017 để nếu MCP lỗi
  // vẫn có thể phát voice "Hardware initialization error".
  setupAudio();

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  lcd.init();
  lcd.backlight();

  if (!mcp.begin_I2C(0x20)) {
    lcd.setCursor(0, 0); lcd.print("Loi Phan Cung!");
    queueVoice(VOICE_HARDWARE_ERROR);
    while (1) { delay(1000); } // Halt hệ thống nhưng vẫn nhường CPU cho audio task.
  }
  
  for (int i = 0; i < 16; i++) {
    mcp.pinMode(i, OUTPUT);
    mcp.digitalWrite(i, HIGH); 
  }

  EEPROM.begin(64);
  for (int i = 0; i < 3; i++) {
    EEPROM.get(addrUsbA[i], usbAngleA[i]); 
    EEPROM.get(addrUsbB[i], usbAngleB[i]);
    if(usbAngleA[i] < 0 || usbAngleA[i] > 180) usbAngleA[i] = 20; 
    if(usbAngleB[i] < 0 || usbAngleB[i] > 180) usbAngleB[i] = 40; 
  }

  EEPROM.get(addrTimeD, delayDisconnect);
  EEPROM.get(addrTimeC, delayConnect); 
  if(delayDisconnect < 0 || delayDisconnect > 1000) delayDisconnect = 3; 
  if(delayConnect < 8 || delayConnect > 1000) delayConnect = 8; 

