smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  // Đọc version LittleFS đã cài từ EEPROM. Không dùng compile-time constant
  // để tránh download lại filesystem sau mỗi lần reboot.
  loadInstalledFsVersion();

  pinMode(BTN_OK, INPUT_PULLUP); 
  pinMode(BTN_DOWN, INPUT_PULLUP);
  pinMode(BTN_PLUS, INPUT_PULLUP); 
  pinMode(BTN_MINUS, INPUT_PULLUP);
  pinMode(BTN_RUN, INPUT_PULLUP);

  // ==========================================
  // MÀN HÌNH KHỞI ĐỘNG (CÓ HIỂN THỊ VERSION)
  // ==========================================
  lcd.setCursor(6, 1); lcd.print("INNOVA");
  delay(1000); 
  
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print(" INNOVA Automation");
  
  // Hiển thị Firmware Version ra giữa màn hình
  lcd.setCursor(1, 2); 
  lcd.print("Firmware V"); 
  lcd.print(CURRENT_VERSION);

  lcd.setCursor(0, 3); lcd.print("- Design by TuanLe -");
  delay(3000); 

  // ==========================================================
  // WIFI KHI BOOT
  // - Chỉ thử kết nối Wi-Fi đã lưu.
  // - Nếu không kết nối được: chạy Offline.
  // - KHÔNG tự phát AP "ATE_Setup_WiFi" khi BOOT.
  // - Muốn đổi/cấu hình Wi-Fi: user vào Function -> Wifi Setting.
  // ==========================================================
  lcd.clear();
  printCentered(0, "WIFI CONNECTION");
  lcd.setCursor(0, 1); lcd.print("Connecting...");

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(); // Dùng SSID/password đã lưu trong NVS của ESP32

  unsigned long wifiStartMillis = millis();
  while (WiFi.status() != WL_CONNECTED &&
         millis() - wifiStartMillis < WIFI_BOOT_CONNECT_TIMEOUT_MS) {
    delay(250);
  }

  if (WiFi.status() == WL_CONNECTED) {
    lcd.clear();
    printCentered(0, "WIFI CONNECTED!");
    lcd.setCursor(0, 1); lcd.print("IP:");
    lcd.print(WiFi.localIP());
    delay(1500);

    setupArduinoOTA();
    updateFirmwareFromInternet();
    setupAteWebServer();

  } else {
    lcd.clear();
    printCentered(1, "WIFI FAILED!");
    lcd.setCursor(0, 2); lcd.print("Running Offline Mode");
    queueVoice(VOICE_WIFI_FAILED);
    delay(2000);
  }

  // KHỞI ĐỘNG VÀO CHỜ PC MODE
  isRunning = true;         
  isRunManually = false;    
  currentPair = 0;
  runStep = 6;              
  
  lcd.clear();
  printCentered(0, "SYSTEM RUN (PC)");
  lcd.setCursor(0, 1); lcd.print("Tool: 1");
  lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
  lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");

  currentScreen = 2; 

  // Voice quan trọng khi hệ thống đã hoàn tất boot và sẵn sàng.
  queueVoice(VOICE_SYSTEM_READY);
}

void loop() {
  // WiFiManager portal chạy NON-BLOCKING để vẫn đọc được button OK/DOWN.
  if (wifiPortalActive) {
    wifiManager.process();

    // Vì đã chủ động disconnect Wi-Fi cũ trước khi mở portal,
    // WL_CONNECTED ở đây nghĩa là user đã chọn Wi-Fi và kết nối thành công.
    if (!wifiExitConfirm && WiFi.status() == WL_CONNECTED) {
      wifiPortalActive = false;
      wifiManager.stopConfigPortal();

      lcd.clear();
      printCentered(1, "WiFi Updated!");
      lcd.setCursor(0, 2); lcd.print("Rebooting...");
      delay(2000);
      ESP.restart();
    }
  }

  // WebServer tự start/restart khi STA Wi-Fi sẵn sàng. Điều này cũng cover
  // trường hợp user thoát WiFi Setting mà không reboot, hoặc FS OTA lỗi rồi remount.
  if (!webServerStarted && WiFi.status() == WL_CONNECTED && !wifiPortalActive && !localOtaInProgress) {
    setupAteWebServer();
  }

  if (webServerStarted && WiFi.status() == WL_CONNECTED && !wifiPortalActive && !localOtaInProgress) {
    ateWeb.handleClient();
  }

  // Các action làm mất connection/reboot được defer để HTTP response kịp gửi về browser.
  processPendingWebAction();

  if (WiFi.status() == WL_CONNECTED && !wifiPortalActive) {
    ArduinoOTA.handle(); 
  }

  handleSerialCommands();

  bool ok    = digitalRead(BTN_OK);
  bool down  = digitalRead(BTN_DOWN);
  bool plus  = digitalRead(BTN_PLUS);
  bool minus = digitalRead(BTN_MINUS);
  bool run   = digitalRead(BTN_RUN);

  // ======================================================
  // BUTTON SOUND
  // Chỉ beep khi có cạnh nhấn mới của 5 nút vật lý.
  // Không dùng beep cho USB/DLC/Tool change/Warning/Error.
  // ======================================================
  if (ok    == LOW && lastOk    == HIGH) requestButtonBeep();
  if (down  == LOW && lastDown  == HIGH) requestButtonBeep();
  if (plus  == LOW && lastPlus  == HIGH) requestButtonBeep();
  if (minus == LOW && lastMinus == HIGH) requestButtonBeep();
  if (run   == LOW && lastRun   == HIGH) requestButtonBeep();

  if (!wifiPortalActive && run == LOW && lastRun == HIGH) {
    if (isRunning) {
      safeStopAll(); 
      queueVoice(VOICE_AUTOMATION_STOPPED);
      isRunning = false; 
      currentScreen = 2;
      cursorIndex = 0;
      drawScreen(); 
    } else {
      isRunning = true; 
      isRunManually = false; 
      skipManualKeyTest = false;
      currentPair = 0; 
      runStep = 6; 
      lcd.clear();
      printCentered(0, "SYSTEM RUN (PC)");
      lcd.setCursor(0, 1); lcd.print("Tool: 1");
      lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
      lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");
    }
    delay(150); 
  }

  if (isRunning) { handleRunSequence(); goto UPDATE_STATE; }

  // THUẬT TOÁN CUỘN TRANG CẬP NHẬT CHO 5 MỤC MENU
  if (down == LOW && lastDown == HIGH) {
    if (wifiPortalActive && wifiExitConfirm) {
      // Ở màn hình xác nhận thoát WiFi Setting:
      // DOWN dùng để đổi giữa No <-> Yes.
      wifiExitSelection = (wifiExitSelection + 1) % 2;
      drawWifiExitConfirmScreen();
    }
    else if (currentScreen == 2) {
      cursorIndex = (cursorIndex + 1) % 5; 
      drawScreen();
    }
    else if (currentScreen >= 4 && currentScreen <= 6) {
      cursorIndex = (cursorIndex + 1) % 2; 
      drawScreen();
    }
    else if (currentScreen == 10) {
      // Run Manually submenu: Include Key Test / Skip Key Test
      cursorIndex = (cursorIndex + 1) % 2;
      drawScreen();
    }
    delay(150);
  }

  if (ok == LOW && lastOk == HIGH) {
    // ======================================================
    // WIFI SETTING: OK -> hỏi có muốn thoát hay không
    // ======================================================
    if (wifiPortalActive) {
      if (!wifiExitConfirm) {
        wifiExitConfirm = true;
        wifiExitSelection = 0; // Mặc định = No để tránh thoát nhầm.
        drawWifiExitConfirmScreen();
      } else {
        if (wifiExitSelection == 1) {
          // Yes -> đóng AP cấu hình và quay lại Function.
          stopWifiSettingPortalAndReturn();
        } else {
          // No -> quay lại màn hình WiFi Setting, portal vẫn tiếp tục chạy.
          wifiExitConfirm = false;
          drawWifiSettingScreen();
        }
      }

      delay(150);
      goto UPDATE_STATE;
    }

    if (currentScreen == 2) {
      if (cursorIndex == 0) {
        // Run Manually -> chọn có test 11 keys hay bỏ qua key test.
        currentScreen = 10;
        cursorIndex = 0;
      }
      else if (cursorIndex == 1) { currentScreen = 4; cursorIndex = 0; } 
      else if (cursorIndex == 2) { currentScreen = 9; cursorIndex = 0; } 
      else if (cursorIndex == 3) { currentScreen = 8; cursorIndex = 0; } 
      else if (cursorIndex == 4) { 
        // =======================================
        // CHỨC NĂNG ĐỔI WIFI TỪ MENU
        // =======================================
        // Không timeout. Portal chạy non-blocking để button OK/DOWN vẫn hoạt động.
        startWifiSettingPortal();
        delay(150);
        goto UPDATE_STATE;
      }
    } 
    else if (currentScreen == 10) {
      isRunning = true;
      isRunManually = true;
      skipManualKeyTest = (cursorIndex == 1);
      currentPair = 0;

      runStep = 2;
      previousMillis = millis();

      lcd.clear();
      if (skipManualKeyTest) printCentered(0, "SYSTEM RUN (AUTO2)");
      else                   printCentered(0, "SYSTEM RUN (AUTO)");
      lcd.setCursor(0, 1); lcd.print("Tool: 1");
      lcd.setCursor(0, 2); lcd.print("Wait Disconnect...  ");
      lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");

      // Voice mode + Tool 1. Không có voice "Automatic test completed"
      // vì AUTO/AUTO2 hiện chạy vòng liên tục 1 -> 2 -> 3 -> 1.
      if (skipManualKeyTest) queueVoice(VOICE_AUTO_SKIP_KEY);
      else                   queueVoice(VOICE_AUTO_WITH_KEY);
      queueToolVoice(0);

      delay(150);
      goto UPDATE_STATE;
    }
    else if (currentScreen == 4) { currentScreen = 5; cursorIndex = 0; }
    else if (currentScreen == 5) { currentScreen = 6; cursorIndex = 0; }
    else if (currentScreen == 6 || currentScreen == 8 || currentScreen == 9) {
       for (int i = 0; i < 3; i++) {
         EEPROM.put(addrUsbA[i], usbAngleA[i]); 
         EEPROM.put(addrUsbB[i], usbAngleB[i]);
       }
       EEPROM.put(addrTimeD, delayDisconnect);
       EEPROM.put(addrTimeC, delayConnect);
       EEPROM.commit(); 
       currentScreen = 2; cursorIndex = 0; 
    }
    drawScreen(); delay(150);
  }

