smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  if (plus == LOW && lastPlus == HIGH) {
    if (currentScreen >= 4 && currentScreen <= 6) {
      int t = currentScreen - 4; 
      if (cursorIndex == 0) usbAngleA[t] = min(180, usbAngleA[t] + 1); 
      else usbAngleB[t] = min(180, usbAngleB[t] + 1); 
      drawScreen();
    } 
    else if (currentScreen == 8) { delayDisconnect++; drawScreen(); }
    else if (currentScreen == 9) { delayConnect++; drawScreen(); }
    delay(100);
  }

  if (minus == LOW && lastMinus == HIGH) {
    if (currentScreen >= 4 && currentScreen <= 6) {
      int t = currentScreen - 4; 
      if (cursorIndex == 0) usbAngleA[t] = max(0, usbAngleA[t] - 1); 
      else usbAngleB[t] = max(0, usbAngleB[t] - 1); 
      drawScreen();
    } 
    else if (currentScreen == 8) { delayDisconnect = max(0, delayDisconnect - 1); drawScreen(); }
    else if (currentScreen == 9) { delayConnect = max(8, delayConnect - 1); drawScreen(); }
    delay(100);
  }

UPDATE_STATE:
  lastOk = ok; lastDown = down; lastPlus = plus; lastMinus = minus; lastRun = run;
}


// ==========================================
// WEB UI V1 - LOCAL DASHBOARD / CONTROL
// ==========================================
String webModeName() {
  if (!isRunning) return "STOPPED";
  if (!isRunManually) return "PC";
  return skipManualKeyTest ? "AUTO2" : "AUTO";
}

String webStepName() {
  if (wifiPortalActive) return "WiFi Setting";
  if (localOtaInProgress) return localOtaFilesystemUpdate ? "Local Filesystem OTA" : "Local Firmware OTA";
  if (!isRunning) return "Stopped";

  if (!isRunManually) {
    if (runStep == 6) return "Waiting PC Command";
    if (runStep >= 7 && runStep <= 9) return "Changing Tool";
    return "PC Command";
  }

  switch (runStep) {
    case 2:  return "Wait Disconnect";
    case 3:  return "USB Connecting";
    case 4:  return "USB Connected";
    case 5:  return "DLC Connecting";
    case 6:  return skipManualKeyTest ? "Delay Connect" : "Waiting Key Test";
    case 61: return "Key Test Complete";
    case 7:
    case 8:
    case 9:  return "Changing Tool";
    default: return "Running";
  }
}

void sendWebJson(int httpCode, JsonDocument& doc) {
  String body;
  serializeJson(doc, body);
  ateWeb.sendHeader("Cache-Control", "no-store");
  ateWeb.send(httpCode, "application/json", body);
}

void sendWebMessage(int httpCode, const char* status, const char* message) {
  JsonDocument doc;
  doc["status"] = status;
  doc["message"] = message;
  sendWebJson(httpCode, doc);
}

bool parseWebJson(JsonDocument& doc) {
  if (!ateWeb.hasArg("plain")) return false;
  DeserializationError err = deserializeJson(doc, ateWeb.arg("plain"));
  return !err;
}

bool webManualControlAllowed() {
  return !isRunning && !wifiPortalActive && !localOtaInProgress && pendingWebAction == WEB_ACTION_NONE;
}

void serveAteWebFile(const char* path, const char* contentType) {
  if (!audioFSReady) {
    if (strcmp(path, "/web/index.html") == 0) {
      ateWeb.send_P(200, "text/html", WEB_FALLBACK_HTML);
    } else {
      ateWeb.send(404, "text/plain", "LittleFS is not mounted");
    }
    return;
  }

  File f = LittleFS.open(path, "r");
  if (!f) {
    if (strcmp(path, "/web/index.html") == 0) {
      ateWeb.send_P(200, "text/html", WEB_FALLBACK_HTML);
    } else {
      ateWeb.send(404, "text/plain", "Web asset not found");
    }
    return;
  }

  ateWeb.sendHeader("Cache-Control", "no-cache");
  ateWeb.streamFile(f, contentType);
  f.close();
}

void webStartPcMode() {
  isRunning = true;
  isRunManually = false;
  skipManualKeyTest = false;
  currentPair = 0;
  runStep = 6;

  lcd.clear();
  printCentered(0, "SYSTEM RUN (PC)");
  lcd.setCursor(0, 1); lcd.print("Tool: 1");
  lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
  lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");
}

void webStartManualMode(bool skipKeyTest) {
  isRunning = true;
  isRunManually = true;
  skipManualKeyTest = skipKeyTest;
  currentPair = 0;
  runStep = 2;
  previousMillis = millis();

  lcd.clear();
  if (skipManualKeyTest) printCentered(0, "SYSTEM RUN (AUTO2)");
  else                   printCentered(0, "SYSTEM RUN (AUTO)");
  lcd.setCursor(0, 1); lcd.print("Tool: 1");
  lcd.setCursor(0, 2); lcd.print("Wait Disconnect...  ");
  lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");

  if (skipManualKeyTest) queueVoice(VOICE_AUTO_SKIP_KEY);
  else                   queueVoice(VOICE_AUTO_WITH_KEY);
  queueToolVoice(0);
}

void webStopAutomation() {
  if (isRunning) {
    safeStopAll();
    queueVoice(VOICE_AUTOMATION_STOPPED);
  }
  isRunning = false;
  isRunManually = false;
  skipManualKeyTest = false;
  currentScreen = 2;
  cursorIndex = 0;
  drawScreen();
}

bool fetchOtaManifestForWeb(String& fwVersion, uint32_t& fwCode, String& fsVersion, uint32_t& fsCode, String& errorText) {
  fwVersion = "";
  fsVersion = "";
  fwCode = 0;
  fsCode = 0;
  errorText = "";

  if (WiFi.status() != WL_CONNECTED) {
    errorText = "WiFi not connected";
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(12000);

  HTTPClient http;
  if (!http.begin(client, version_url)) {
    errorText = "Cannot open version URL";
    return false;
  }

  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    errorText = "HTTP " + String(code);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  JsonDocument doc;
  if (deserializeJson(doc, payload)) {
    errorText = "Invalid version.json";
    return false;
  }

  fwVersion = String((const char*)(doc["firmware"]["version"] | ""));
  fwCode = doc["firmware"]["version_code"] | 0;
  fsVersion = String((const char*)(doc["filesystem"]["version"] | ""));
  fsCode = doc["filesystem"]["version_code"] | 0;

  if (fwVersion.length() == 0 || fwCode == 0 || fsVersion.length() == 0 || fsCode == 0) {
    errorText = "Manifest missing firmware/filesystem fields";
    return false;
  }

  return true;
}

void configureAteWebRoutes() {
  if (webRoutesConfigured) return;

  ateWeb.on("/", HTTP_GET, []() {
    serveAteWebFile("/web/index.html", "text/html");
  });
  ateWeb.on("/style.css", HTTP_GET, []() {
    serveAteWebFile("/web/style.css", "text/css");
  });
  ateWeb.on("/app.js", HTTP_GET, []() {
    serveAteWebFile("/web/app.js", "application/javascript");
  });
  ateWeb.on("/favicon.ico", HTTP_GET, []() {
    ateWeb.send(204, "text/plain", "");
  });

  // -------------------- STATUS --------------------
  ateWeb.on("/api/status", HTTP_GET, []() {
    JsonDocument doc;
    doc["station"] = ATE_STATION_NAME;
    doc["running"] = isRunning;
    doc["mode"] = webModeName();
    doc["tool"] = currentPair + 1;
    doc["step"] = webStepName();
    doc["run_step"] = runStep;
    doc["fw_version"] = CURRENT_VERSION;
    doc["fw_version_code"] = CURRENT_VERSION_CODE;
    doc["fs_version"] = versionCodeToName(installedFsVersionCode);
    doc["fs_version_code"] = installedFsVersionCode;
    doc["wifi_connected"] = (WiFi.status() == WL_CONNECTED);
    doc["ssid"] = (WiFi.status() == WL_CONNECTED) ? WiFi.SSID() : "";
    doc["rssi"] = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;
    doc["ip"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : "0.0.0.0";
    doc["uptime_s"] = millis() / 1000UL;
    doc["littlefs_ready"] = audioFSReady;
    doc["audio_ready"] = audioI2SReady;
    doc["wifi_portal_active"] = wifiPortalActive;
    doc["local_ota"] = localOtaInProgress;
    sendWebJson(200, doc);
  });

  // -------------------- RUN CONTROL --------------------
  ateWeb.on("/api/run", HTTP_POST, []() {
    if (wifiPortalActive || localOtaInProgress || pendingWebAction != WEB_ACTION_NONE) {
      sendWebMessage(409, "busy", "ATE is busy with WiFi/OTA operation");
      return;
    }
    if (isRunning) {
      sendWebMessage(409, "busy", "Stop the current mode before starting another mode");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    String mode = String((const char*)(req["mode"] | ""));
    mode.toLowerCase();

    if (mode == "pc") webStartPcMode();
    else if (mode == "auto") webStartManualMode(false);
    else if (mode == "auto2") webStartManualMode(true);
    else {
      sendWebMessage(400, "error", "mode must be pc, auto or auto2");
      return;
    }

    sendWebMessage(200, "ok", "Automation started");
  });

