smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  ateWeb.on("/api/stop", HTTP_POST, []() {
    if (wifiPortalActive || localOtaInProgress) {
      sendWebMessage(409, "busy", "ATE is busy with WiFi/OTA operation");
      return;
    }
    webStopAutomation();
    sendWebMessage(200, "ok", "Automation stopped");
  });

  // -------------------- MANUAL HARDWARE --------------------
  ateWeb.on("/api/manual/usb", HTTP_POST, []() {
    if (!webManualControlAllowed()) {
      sendWebMessage(409, "busy", "Stop Automation before manual hardware control");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    int tool = req["tool"] | 0;
    String action = String((const char*)(req["action"] | ""));
    action.toLowerCase();
    if (tool < 1 || tool > 3 || (action != "connect" && action != "disconnect")) {
      sendWebMessage(400, "error", "Invalid tool/action");
      return;
    }

    int idx = tool - 1;
    usbServos[idx].attach(USB_SERVO_PINS[idx]);
    usbServos[idx].write(action == "connect" ? usbAngleB[idx] : usbAngleA[idx]);
    delay(600);
    detachServoSafe(idx);
    sendWebMessage(200, "ok", "USB actuator command completed");
  });

  ateWeb.on("/api/manual/dlc", HTTP_POST, []() {
    if (!webManualControlAllowed()) {
      sendWebMessage(409, "busy", "Stop Automation before manual hardware control");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    int tool = req["tool"] | 0;
    String action = String((const char*)(req["action"] | ""));
    action.toLowerCase();
    if (tool < 1 || tool > 3 || (action != "connect" && action != "disconnect")) {
      sendWebMessage(400, "error", "Invalid tool/action");
      return;
    }

    int idx = tool - 1;
    mcp.digitalWrite(DLC_RELAY_PINS[idx], action == "connect" ? LOW : HIGH);
    sendWebMessage(200, "ok", "DLC relay command completed");
  });

  ateWeb.on("/api/manual/key", HTTP_POST, []() {
    if (!webManualControlAllowed()) {
      sendWebMessage(409, "busy", "Stop Automation before manual key control");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    bool allKeys = req["all"] | false;
    if (allKeys) {
      trigger11Keys();
      sendWebMessage(200, "ok", "All 11 keys tested");
      return;
    }

    int key = req["key"] | 0;
    if (key < 1 || key > 11) {
      sendWebMessage(400, "error", "key must be 1..11");
      return;
    }

    int pin = key - 1;
    mcp.digitalWrite(pin, LOW); delay(200);
    mcp.digitalWrite(pin, HIGH); delay(200);
    sendWebMessage(200, "ok", "Key tested");
  });

  ateWeb.on("/api/audio/test", HTTP_POST, []() {
    if (!audioFSReady) {
      sendWebMessage(503, "error", "LittleFS/voice is not ready");
      return;
    }
    queueVoice(VOICE_SYSTEM_READY);
    sendWebMessage(200, "ok", "Voice test queued");
  });

  // -------------------- CONFIG / CALIBRATION --------------------
  ateWeb.on("/api/config", HTTP_GET, []() {
    JsonDocument doc;
    JsonArray a = doc["usbAngleA"].to<JsonArray>();
    JsonArray b = doc["usbAngleB"].to<JsonArray>();
    for (int i = 0; i < 3; i++) {
      a.add(usbAngleA[i]);
      b.add(usbAngleB[i]);
    }
    doc["delayDisconnect"] = delayDisconnect;
    doc["delayConnect"] = delayConnect;
    sendWebJson(200, doc);
  });

  ateWeb.on("/api/config", HTTP_POST, []() {
    if (isRunning || wifiPortalActive || localOtaInProgress) {
      sendWebMessage(409, "busy", "Stop Automation before changing configuration");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    JsonArray a = req["usbAngleA"].as<JsonArray>();
    JsonArray b = req["usbAngleB"].as<JsonArray>();
    int newDelayD = req["delayDisconnect"] | -1;
    int newDelayC = req["delayConnect"] | -1;

    if (a.size() != 3 || b.size() != 3 || newDelayD < 0 || newDelayD > 1000 || newDelayC < 8 || newDelayC > 1000) {
      sendWebMessage(400, "error", "Invalid calibration/delay values");
      return;
    }

    for (int i = 0; i < 3; i++) {
      int va = a[i] | -1;
      int vb = b[i] | -1;
      if (va < 0 || va > 180 || vb < 0 || vb > 180) {
        sendWebMessage(400, "error", "Servo angle must be 0..180");
        return;
      }
      usbAngleA[i] = va;
      usbAngleB[i] = vb;
    }

    delayDisconnect = newDelayD;
    delayConnect = newDelayC;

    for (int i = 0; i < 3; i++) {
      EEPROM.put(addrUsbA[i], usbAngleA[i]);
      EEPROM.put(addrUsbB[i], usbAngleB[i]);
    }
    EEPROM.put(addrTimeD, delayDisconnect);
    EEPROM.put(addrTimeC, delayConnect);
    EEPROM.commit();

    sendWebMessage(200, "ok", "Configuration saved to EEPROM");
  });

  ateWeb.on("/api/calibration/move", HTTP_POST, []() {
    if (!webManualControlAllowed()) {
      sendWebMessage(409, "busy", "Stop Automation before calibration move");
      return;
    }

    JsonDocument req;
    if (!parseWebJson(req)) {
      sendWebMessage(400, "error", "Invalid JSON body");
      return;
    }

    int tool = req["tool"] | 0;
    int angle = req["angle"] | -1;
    if (tool < 1 || tool > 3 || angle < 0 || angle > 180) {
      sendWebMessage(400, "error", "Invalid tool/angle");
      return;
    }

    int idx = tool - 1;
    usbServos[idx].attach(USB_SERVO_PINS[idx]);
    usbServos[idx].write(angle);
    delay(600);
    detachServoSafe(idx);
    sendWebMessage(200, "ok", "Servo moved");
  });

  // -------------------- WIFI --------------------
  ateWeb.on("/api/wifi/setup", HTTP_POST, []() {
    if (isRunning || localOtaInProgress || pendingWebAction != WEB_ACTION_NONE) {
      sendWebMessage(409, "busy", "Stop Automation before starting WiFi Setup");
      return;
    }
    pendingWebAction = WEB_ACTION_START_WIFI_PORTAL;
    pendingWebActionMillis = millis();
    sendWebMessage(202, "accepted", "WiFi Setup AP will start. Connect phone to ATE_Setup_WiFi.");
  });

  // -------------------- HTTPS OTA --------------------
  ateWeb.on("/api/update/check", HTTP_GET, []() {
    String fwVersion, fsVersion, errorText;
    uint32_t fwCode = 0, fsCode = 0;
    if (!fetchOtaManifestForWeb(fwVersion, fwCode, fsVersion, fsCode, errorText)) {
      JsonDocument doc;
      doc["status"] = "error";
      doc["message"] = errorText;
      sendWebJson(502, doc);
      return;
    }

    JsonDocument doc;
    doc["status"] = "ok";
    doc["current_fw"] = CURRENT_VERSION;
    doc["current_fw_code"] = CURRENT_VERSION_CODE;
    doc["server_fw"] = fwVersion;
    doc["server_fw_code"] = fwCode;
    doc["fw_update_available"] = (fwCode > CURRENT_VERSION_CODE);
    doc["current_fs"] = versionCodeToName(installedFsVersionCode);
    doc["current_fs_code"] = installedFsVersionCode;
    doc["server_fs"] = fsVersion;
    doc["server_fs_code"] = fsCode;
    doc["fs_update_available"] = (fsCode > installedFsVersionCode);
    sendWebJson(200, doc);
  });

