smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  ateWeb.on("/api/update/start", HTTP_POST, []() {
    if (isRunning || wifiPortalActive || localOtaInProgress || pendingWebAction != WEB_ACTION_NONE) {
      sendWebMessage(409, "busy", "Stop Automation before HTTPS OTA");
      return;
    }
    if (WiFi.status() != WL_CONNECTED) {
      sendWebMessage(503, "error", "WiFi not connected");
      return;
    }
    pendingWebAction = WEB_ACTION_HTTPS_OTA;
    pendingWebActionMillis = millis();
    sendWebMessage(202, "accepted", "HTTPS OTA check/update will start. Device may reboot.");
  });

  ateWeb.onNotFound([]() {
    if (ateWeb.uri().startsWith("/api/")) {
      sendWebMessage(404, "error", "API endpoint not found");
    } else {
      serveAteWebFile("/web/index.html", "text/html");
    }
  });

  webRoutesConfigured = true;
}

void setupAteWebServer() {
  if (webServerStarted || WiFi.status() != WL_CONNECTED || wifiPortalActive || localOtaInProgress) return;

  configureAteWebRoutes();
  ateWeb.begin();
  webServerStarted = true;

  // ArduinoOTA đã khởi tạo mDNS với hostname ATE-Tool-System.
  // Add HTTP service để browser có thể thử http://ate-tool-system.local/.
  MDNS.addService("http", "tcp", ATE_WEB_PORT);

  USBSerial.print("[WEB] ATE UI started: http://");
  USBSerial.print(WiFi.localIP());
  USBSerial.println("/");
}

void stopAteWebServer() {
  if (!webServerStarted) return;
  ateWeb.stop();
  webServerStarted = false;
  USBSerial.println("[WEB] WebServer stopped");
}

void processPendingWebAction() {
  if (pendingWebAction == WEB_ACTION_NONE) return;
  if (millis() - pendingWebActionMillis < WEB_DEFERRED_ACTION_DELAY_MS) return;

  WebPendingAction action = pendingWebAction;
  pendingWebAction = WEB_ACTION_NONE;

  if (action == WEB_ACTION_START_WIFI_PORTAL) {
    stopAteWebServer();
    startWifiSettingPortal();
    return;
  }

  if (action == WEB_ACTION_HTTPS_OTA) {
    updateFirmwareFromInternet();
    // Nếu không update hoặc update fail nhưng không reboot, đảm bảo web trở lại.
    if (WiFi.status() == WL_CONNECTED && !wifiPortalActive && !localOtaInProgress) {
      setupAteWebServer();
    }
  }
}

// ==========================================
// LOCAL OTA SETUP
// ==========================================
void setupArduinoOTA() {
  ArduinoOTA.setHostname("ATE-Tool-System");

  // ArduinoOTA mặc định reboot sau update thành công. Set explicit để
  // đảm bảo cả firmware OTA và filesystem OTA đều reboot sau khi hoàn tất.
  // Sau reboot, setupAudio() sẽ mount lại LittleFS và các voice mới sẽ có hiệu lực.
  ArduinoOTA.setRebootOnSuccess(true);

  ArduinoOTA.onStart([]() {
    localOtaInProgress = true;
    localOtaFilesystemUpdate = (ArduinoOTA.getCommand() != U_FLASH);

    lcd.clear();

    if (localOtaFilesystemUpdate) {
      printCentered(0, "LITTLEFS OTA");
      lcd.setCursor(0, 1); lcd.print("Stopping Audio...");

      // QUAN TRỌNG:
      // 1) Chặn enqueue beep/voice mới.
      // 2) Đợi audio task đóng WAV đang phát.
      // 3) Sau đó mới unmount LittleFS.
      bool fsSafe = pauseAudioAndUnmountLittleFSForOta();

      lcd.setCursor(0, 1);
      if (fsSafe) {
        lcd.print("Uploading Voice...  ");
      } else {
        // Không cho OTA tiếp tục nếu audio chưa xác nhận đã đóng file.
        // ArduinoOTA gọi onStart() trước khi nhận/ghi data, vì vậy restart
        // tại đây sẽ hủy phiên OTA trước khi filesystem bị ghi không an toàn.
        lcd.print("Audio Stop Timeout! ");
        lcd.setCursor(0, 2); lcd.print("OTA Aborted - Reboot");
        delay(500);
        ESP.restart();
      }
    } else {
      printCentered(1, "LOCAL OTA UPDATING..");
    }
  });

  ArduinoOTA.onEnd([]() {
    lcd.clear();

    if (localOtaFilesystemUpdate) {
      printCentered(0, "LITTLEFS UPDATED!");
      lcd.setCursor(0, 1); lcd.print("Voice Files Updated");
      lcd.setCursor(0, 2); lcd.print("Rebooting...");

      // Không remount ở đây. ArduinoOTA sẽ reboot ngay sau callback này
      // (setRebootOnSuccess(true)); setupAudio() ở boot kế tiếp sẽ mount
      // LittleFS mới. Đây là cách an toàn nhất sau khi partition vừa được ghi.
    } else {
      printCentered(1, "UPDATE SUCCESS!");
    }
  });

  ArduinoOTA.onError([](ota_error_t error) {
    lcd.clear();
    printCentered(0, "LOCAL OTA FAILED!");
    lcd.setCursor(0, 1); lcd.print("Error: "); lcd.print((int)error);

    // Dùng cả getCommand() để cover trường hợp OTA_BEGIN_ERROR xảy ra
    // trước khi onStart() được gọi. ArduinoOTA dùng U_FLASHFS cho uploadfs.
    bool fsUpdate = localOtaFilesystemUpdate || (ArduinoOTA.getCommand() != U_FLASH);

    if (fsUpdate) {
      // OTA filesystem lỗi thì ArduinoOTA không reboot tự động.
      // Thử mount lại filesystem hiện tại KHÔNG format. Nếu mount được,
      // audio được resume và có thể phát voice OTA failed. Nếu filesystem
      // đã bị ghi dở và mount không được, voice vẫn bị disable an toàn.
      resumeAudioAfterFilesystemOtaError();
    } else {
      queueVoice(VOICE_OTA_FAILED);
    }

    localOtaInProgress = false;
    localOtaFilesystemUpdate = false;
  });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    lcd.setCursor(0, 2);
    lcd.print("Progress: ");
    if (total > 0) {
      lcd.print((progress * 100U) / total);
    } else {
      lcd.print(0);
    }
    lcd.print("%   ");
  });

  ArduinoOTA.begin();
  delay(1500);
}

// ==========================================
// WIFI SETTING - MỞ CONFIG PORTAL KHÔNG TIMEOUT
// ==========================================
void startWifiSettingPortal() {
  isRunning = false;
  isRunManually = false;
  skipManualKeyTest = false;

  // Không cho Wi-Fi cũ tự reconnect trong lúc user đang cấu hình,
  // nếu không code có thể hiểu nhầm Wi-Fi cũ là "WiFi Updated".
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false, false);
  delay(200);

  // Config Portal NON-BLOCKING:
  // - Không setConfigPortalTimeout() => không timeout.
  // - loop() gọi wifiManager.process().
  // - Nhờ vậy vẫn đọc được button OK/DOWN trên thiết bị.
  wifiManager.setConfigPortalBlocking(false);

  // Khi user mở 192.168.4.1, tự chuyển thẳng sang trang /wifi.
  // Đây là workaround cho trường hợp browser trên phone đổi nút
  // "Configure WiFi" thành https://192.168.4.1/wifi và gây lỗi.
  wifiManager.setCustomHeadElement(WIFI_PORTAL_DIRECT_WIFI_PAGE);

  wifiManager.startConfigPortal("ATE_Setup_WiFi");

  wifiPortalActive = true;
  wifiExitConfirm = false;
  wifiExitSelection = 0;

  drawWifiSettingScreen();
}

// ==========================================
// WIFI SETTING - USER CHỌN YES ĐỂ THOÁT
// ==========================================
void stopWifiSettingPortalAndReturn() {
  wifiManager.stopConfigPortal();
  wifiPortalActive = false;
  wifiExitConfirm = false;
  wifiExitSelection = 0;

