smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  // Quay về STA mode và thử reconnect Wi-Fi đã lưu.
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin();

  currentScreen = 2;
  cursorIndex = 4; // Quay lại đúng mục "Wifi Setting".
  drawScreen();
}

// ==========================================
// MÀN HÌNH WIFI SETTING
// ==========================================
void drawWifiSettingScreen() {
  lcd.clear();
  printCentered(0, "WIFI SETTING");
  lcd.setCursor(0, 1); lcd.print("AP: ATE_Setup_WiFi");
  lcd.setCursor(0, 2); lcd.print("Open: 192.168.4.1");
  lcd.setCursor(0, 3); lcd.print("OK: Exit");
}

// ==========================================
// MÀN HÌNH XÁC NHẬN THOÁT WIFI SETTING
// ==========================================
void drawWifiExitConfirmScreen() {
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Exit WiFi Setting?");

  lcd.setCursor(0, 1);
  if (wifiExitSelection == 0) lcd.print("> No");
  else                        lcd.print("  No");

  lcd.setCursor(0, 2);
  if (wifiExitSelection == 1) lcd.print("> Yes");
  else                        lcd.print("  Yes");

  lcd.setCursor(0, 3); lcd.print("DOWN Select OK Enter");
}

// ==========================================
// TỪ ĐIỂN COMMAND TỪ SERIAL PC (COM PORT)
// ==========================================
void handleSerialCommands() {
  while (USBSerial.available()) {
    static byte cmdBuffer[4];
    static int cmdIndex = 0;
    byte incomingByte = USBSerial.read();

    if (incomingByte == 0xAE) {
      cmdIndex = 0; 
    }
    cmdBuffer[cmdIndex++] = incomingByte;

    if (cmdIndex == 4) {
      byte ack[] = {0xAA, cmdBuffer[1], cmdBuffer[2], cmdBuffer[3]};
      USBSerial.write(ack, 4); 
      USBSerial.flush(); 

      if (isRunning && runStep == 6 && !isRunManually) {
        
        if (cmdBuffer[1] == 0x00 && cmdBuffer[2] == 0x01) {
          if (cmdBuffer[3] == 0xFF) {
            lcd.setCursor(0, 2); lcd.print("Testing All Keys... ");
            trigger11Keys(); 
            lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
          } 
          else {
            int pin = -1;
            if (cmdBuffer[3] >= 0x01 && cmdBuffer[3] <= 0x09) { pin = cmdBuffer[3] - 1; } 
            else if (cmdBuffer[3] == 0x10) { pin = 9; }  
            else if (cmdBuffer[3] == 0x11) { pin = 10; } 

            if (pin != -1) {
              int keyNum = pin + 1;
              lcd.setCursor(0, 2); lcd.print("Testing Key "); 
              if (keyNum < 10) lcd.print(" "); lcd.print(keyNum); lcd.print("...   ");
              mcp.digitalWrite(pin, LOW); delay(200);
              mcp.digitalWrite(pin, HIGH); delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
        }
        
        else if (cmdBuffer[1] == 0x00 && cmdBuffer[2] == 0x04) {
          if (cmdBuffer[3] == 0x02) {
            runStep = 7; 
            lcd.setCursor(0, 2); lcd.print("Changing Tool...    ");
          }
          else if (cmdBuffer[3] == 0x00) {
            safeStopAll();
            lcd.clear();
            printCentered(0, "SYSTEM RUN (PC)");
            lcd.setCursor(0, 1); lcd.print("Tool: "); lcd.print(currentPair + 1); 
            lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");
            runStep = 6; 
          }
        }

        else if (cmdBuffer[1] >= 0x01 && cmdBuffer[1] <= 0x03) {
          int toolIndex = cmdBuffer[1] - 1; 
          int toolNum = cmdBuffer[1];       
          
          if (cmdBuffer[2] == 0x02) {
            if (cmdBuffer[3] == 0x00) { 
              lcd.setCursor(0, 2); lcd.print("Disconnect USB "); lcd.print(toolNum); lcd.print("... ");
              usbServos[toolIndex].attach(USB_SERVO_PINS[toolIndex]); 
              usbServos[toolIndex].write(usbAngleA[toolIndex]);             
              delay(600); 
              detachServoSafe(toolIndex);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            } 
            else if (cmdBuffer[3] == 0x01) { 
              lcd.setCursor(0, 2); lcd.print("Connect USB "); lcd.print(toolNum); lcd.print("...    ");
              usbServos[toolIndex].attach(USB_SERVO_PINS[toolIndex]); 
              usbServos[toolIndex].write(usbAngleB[toolIndex]);             
              delay(600); 
              detachServoSafe(toolIndex);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
          else if (cmdBuffer[2] == 0x03) {
            if (cmdBuffer[3] == 0x00) { 
              lcd.setCursor(0, 2); lcd.print("Disconnect DLC "); lcd.print(toolNum); lcd.print("... ");
              mcp.digitalWrite(DLC_RELAY_PINS[toolIndex], HIGH); 
              delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            } 
            else if (cmdBuffer[3] == 0x01) { 
              lcd.setCursor(0, 2); lcd.print("Connect DLC "); lcd.print(toolNum); lcd.print("...    ");
              mcp.digitalWrite(DLC_RELAY_PINS[toolIndex], LOW); 
              delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
        }
      }
      cmdIndex = 0; 
    }
  }
}

// ==========================================
// HTTPS OTA TỪ INTERNET - FIRMWARE + LITTLEFS
// version.json dạng:
// {
//   "firmware": {
//     "version": "03.00.10",
//     "version_code": 30010,
//     "bin_file": "ATE_FW_v03.00.10.bin"
//   },
//   "filesystem": {
//     "version": "01.00.01",
//     "version_code": 10001,
//     "bin_file": "ATE_LittleFS_v01.00.01.bin"
//   }
// }
//
// Flow an toàn:
// 1) Check manifest 1 lần.
// 2) Nếu FW mới: update FW trước, KHÔNG reboot.
// 3) Nếu FS mới: stop audio -> close WAV -> LittleFS.end() -> update LittleFS.
// 4) Nếu có update thành công: reboot đúng 1 lần.
// 5) Nếu FW cần update nhưng FW fail: KHÔNG update FS để tránh mismatch.
// ==========================================
void updateFirmwareFromInternet() {
  lcd.clear();
  printCentered(0, "HTTPS OTA");
  lcd.setCursor(0, 1);
  lcd.print("Checking versions...");

