smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
  i2s_zero_dma_buffer(AUDIO_I2S_PORT);
  audioI2SReady = true;

  // formatOnFail=true giúp tạo LittleFS lần đầu trên board mới.
  audioFSReady = LittleFS.begin(true);
  if (!audioFSReady) {
    USBSerial.println("[AUDIO] LittleFS mount failed - button beep still available, voice disabled");
  }

  audioBeepQueue = xQueueCreate(8, sizeof(uint8_t));
  audioVoiceQueue = xQueueCreate(8, sizeof(const char*));

  if (audioBeepQueue == nullptr || audioVoiceQueue == nullptr) {
    USBSerial.println("[AUDIO] Queue creation failed");
    audioI2SReady = false;
    return;
  }

  BaseType_t result = xTaskCreatePinnedToCore(
    audioTask,
    "ATE_Audio",
    8192,
    nullptr,
    1,
    &audioTaskHandle,
    0
  );

  if (result != pdPASS) {
    USBSerial.println("[AUDIO] Audio task creation failed");
    audioTaskHandle = nullptr;
    audioI2SReady = false;
  }
}

// ==========================================
// AUDIO / LITTLEFS - SAFE LOCAL OTA SUPPORT
// ==========================================
void writeAudioSilence() {
  if (!audioI2SReady) return;

  // Xóa DMA TX để tránh giữ lại sample cuối khi dừng audio.
  i2s_zero_dma_buffer(AUDIO_I2S_PORT);
}

bool pauseAudioAndUnmountLittleFSForOta() {
  // Ngăn request mới ngay lập tức.
  audioFsOtaPauseRequested = true;

  // Bỏ các beep/voice còn đang chờ. Voice đang phát sẽ tự thoát ở
  // playVoiceWavInternal(), đóng File, rồi audioTask xác nhận Paused.
  if (audioBeepQueue != nullptr) xQueueReset(audioBeepQueue);
  if (audioVoiceQueue != nullptr) xQueueReset(audioVoiceQueue);

  // Nếu audio task không tồn tại thì không có reader nào cần chờ.
  if (audioTaskHandle == nullptr || !audioI2SReady) {
    audioFsOtaPaused = true;
  } else {
    unsigned long startWait = millis();
    while (!audioFsOtaPaused && (millis() - startWait < AUDIO_FS_OTA_PAUSE_TIMEOUT_MS)) {
      delay(5);
    }
  }

  if (!audioFsOtaPaused) {
    USBSerial.println("[OTA-FS] Audio pause timeout - LittleFS NOT unmounted");
    return false;
  }

  // Chỉ unmount sau khi audio task đã xác nhận không còn giữ WAV mở.
  // Web UI cũng đọc static assets từ LittleFS, vì vậy phải dừng WebServer trước.
  stopAteWebServer();

  if (audioFSReady) {
    LittleFS.end();
    audioFSReady = false;
  }

  USBSerial.println("[OTA-FS] Audio stopped, LittleFS unmounted safely");
  return true;
}

void resumeAudioAfterFilesystemOtaError() {
  // OTA lỗi: thử mount lại mà KHÔNG format để không làm mất dữ liệu còn lại.
  if (!audioFSReady) {
    audioFSReady = LittleFS.begin(false);
  }

  if (audioFSReady) {
    USBSerial.println("[OTA-FS] LittleFS remounted after OTA error");
  } else {
    USBSerial.println("[OTA-FS] LittleFS remount failed after OTA error - voice disabled");
  }

  // Cho phép audio task chạy lại. Beep vẫn hoạt động kể cả khi FS mount fail;
  // voice chỉ hoạt động khi audioFSReady == true.
  audioFsOtaPauseRequested = false;

  unsigned long startWait = millis();
  while (audioFsOtaPaused && (millis() - startWait < 500UL)) {
    delay(5);
  }

  // Web vẫn có thể chạy cả khi FS mount fail (sẽ hiện fallback page + API status).
  if (WiFi.status() == WL_CONNECTED && !wifiPortalActive && !localOtaInProgress) {
    setupAteWebServer();
  }

  if (audioFSReady) queueVoice(VOICE_OTA_FAILED);
}

void requestButtonBeep() {
  if (!audioI2SReady || audioBeepQueue == nullptr || audioFsOtaPauseRequested) return;
  uint8_t token = 1;
  xQueueSend(audioBeepQueue, &token, 0); // Không block main loop nếu queue đầy.
}

void queueVoice(const char* filePath) {
  if (!audioI2SReady || !audioFSReady || audioVoiceQueue == nullptr || filePath == nullptr || audioFsOtaPauseRequested) return;
  xQueueSend(audioVoiceQueue, &filePath, 0); // Không block ATE logic.
}

void queueToolVoice(int toolIndex) {
  if (toolIndex == 0) queueVoice(VOICE_TOOL_1);
  else if (toolIndex == 1) queueVoice(VOICE_TOOL_2);
  else if (toolIndex == 2) queueVoice(VOICE_TOOL_3);
}

void playButtonBeepInternal() {
  if (!audioI2SReady || audioFsOtaPauseRequested) return;

  if (i2s_set_clk(
        AUDIO_I2S_PORT,
        BUTTON_BEEP_SAMPLE_RATE,
        I2S_BITS_PER_SAMPLE_16BIT,
        I2S_CHANNEL_MONO) != ESP_OK) {
    return;
  }

  const uint32_t totalSamples = (BUTTON_BEEP_SAMPLE_RATE * BUTTON_BEEP_DURATION_MS) / 1000UL;
  const uint32_t fadeSamples = BUTTON_BEEP_SAMPLE_RATE / 200UL; // ~5 ms fade in/out
  const float phaseStep = 2.0f * PI * (float)BUTTON_BEEP_FREQ_HZ / (float)BUTTON_BEEP_SAMPLE_RATE;

  int16_t buffer[128];
  uint32_t generated = 0;

  while (generated < totalSamples) {
    if (audioFsOtaPauseRequested) break;

    uint32_t chunkSamples = min((uint32_t)128, totalSamples - generated);

    for (uint32_t i = 0; i < chunkSamples; i++) {
      uint32_t sampleIndex = generated + i;
      float envelope = 1.0f;

      if (sampleIndex < fadeSamples) {
        envelope = (float)sampleIndex / (float)fadeSamples;
      } else if (sampleIndex > totalSamples - fadeSamples) {
        envelope = (float)(totalSamples - sampleIndex) / (float)fadeSamples;
      }

      float sample = sinf(phaseStep * (float)sampleIndex);
      buffer[i] = (int16_t)((float)BUTTON_BEEP_AMPLITUDE * envelope * sample);
    }

    size_t bytesWritten = 0;
    esp_err_t err = i2s_write(
      AUDIO_I2S_PORT,
      buffer,
      chunkSamples * sizeof(int16_t),
      &bytesWritten,
      portMAX_DELAY
    );
    if (err != ESP_OK) break;

    generated += chunkSamples;
  }
}

bool parseWavHeader(File& file, uint32_t& sampleRate, uint16_t& channels, uint16_t& bitsPerSample, uint32_t& dataSize) {
  sampleRate = 0;
  channels = 0;
  bitsPerSample = 0;
  dataSize = 0;

  uint8_t riffHeader[12];
  if (file.read(riffHeader, sizeof(riffHeader)) != sizeof(riffHeader)) return false;
  if (memcmp(riffHeader, "RIFF", 4) != 0 || memcmp(riffHeader + 8, "WAVE", 4) != 0) return false;

  bool fmtFound = false;

  while (file.available()) {
    uint8_t chunkHeader[8];
    if (file.read(chunkHeader, sizeof(chunkHeader)) != sizeof(chunkHeader)) return false;

