smartcartech/SmartCarTech_Web/ate-automation/src/FW_v04.00.01_ESP32_3USB_3DLC_OTA.cpp
    uint32_t chunkSize = readLE32(chunkHeader + 4);

    if (memcmp(chunkHeader, "fmt ", 4) == 0) {
      if (chunkSize < 16) return false;

      uint8_t fmt[16];
      if (file.read(fmt, sizeof(fmt)) != sizeof(fmt)) return false;

      uint16_t audioFormat = readLE16(fmt + 0);
      channels = readLE16(fmt + 2);
      sampleRate = readLE32(fmt + 4);
      bitsPerSample = readLE16(fmt + 14);

      // Chỉ hỗ trợ WAV PCM chuẩn để playback nhẹ và ổn định.
      if (audioFormat != 1) return false;

      if (chunkSize > 16) file.seek(file.position() + (chunkSize - 16));
      if (chunkSize & 1U) file.seek(file.position() + 1); // RIFF chunk padding
      fmtFound = true;
    }
    else if (memcmp(chunkHeader, "data", 4) == 0) {
      if (!fmtFound) return false;
      dataSize = chunkSize;
      return true; // File pointer đang đứng đúng đầu PCM data.
    }
    else {
      file.seek(file.position() + chunkSize + (chunkSize & 1U));
    }
  }

  return false;
}

bool playVoiceWavInternal(const char* filePath) {
  if (!audioI2SReady || !audioFSReady || filePath == nullptr || audioFsOtaPauseRequested) return false;

  File file = LittleFS.open(filePath, "r");
  if (!file) {
    USBSerial.print("[AUDIO] Missing voice file: ");
    USBSerial.println(filePath);
    return false;
  }

  uint32_t sampleRate = 0;
  uint16_t channels = 0;
  uint16_t bitsPerSample = 0;
  uint32_t dataSize = 0;

  if (!parseWavHeader(file, sampleRate, channels, bitsPerSample, dataSize)) {
    USBSerial.print("[AUDIO] Invalid WAV: ");
    USBSerial.println(filePath);
    file.close();
    return false;
  }

  if (channels != 1 || bitsPerSample != 16 || sampleRate < 8000 || sampleRate > 96000) {
    USBSerial.print("[AUDIO] WAV must be PCM 16-bit MONO: ");
    USBSerial.println(filePath);
    file.close();
    return false;
  }

  if (i2s_set_clk(
        AUDIO_I2S_PORT,
        sampleRate,
        I2S_BITS_PER_SAMPLE_16BIT,
        I2S_CHANNEL_MONO) != ESP_OK) {
    file.close();
    return false;
  }

  uint8_t buffer[1024];
  uint32_t remaining = dataSize;

  while (remaining > 0 && file.available()) {
    // Filesystem OTA được ưu tiên tuyệt đối: dừng playback, thoát vòng lặp
    // và đóng File trước khi audioTask báo Paused cho OTA callback.
    if (audioFsOtaPauseRequested) break;

    // Button feedback được ưu tiên cả khi đang phát voice.
    uint8_t beepToken = 0;
    if (audioBeepQueue != nullptr && xQueueReceive(audioBeepQueue, &beepToken, 0) == pdTRUE) {
      playButtonBeepInternal();
      i2s_set_clk(
        AUDIO_I2S_PORT,
        sampleRate,
        I2S_BITS_PER_SAMPLE_16BIT,
        I2S_CHANNEL_MONO
      );
    }

    size_t toRead = min((uint32_t)sizeof(buffer), remaining);
    // 16-bit PCM => luôn write số byte chẵn.
    if (toRead & 1U) toRead--;
    if (toRead == 0) break;

    size_t bytesRead = file.read(buffer, toRead);
    if (bytesRead == 0) break;
    if (bytesRead & 1U) bytesRead--;

    if (VOICE_VOLUME_PERCENT < 100) {
      int16_t* samples = reinterpret_cast<int16_t*>(buffer);
      size_t sampleCount = bytesRead / sizeof(int16_t);
      for (size_t i = 0; i < sampleCount; i++) {
        int32_t scaled = ((int32_t)samples[i] * VOICE_VOLUME_PERCENT) / 100;
        samples[i] = (int16_t)scaled;
      }
    }

    size_t bytesWritten = 0;
    esp_err_t writeErr = i2s_write(
      AUDIO_I2S_PORT,
      buffer,
      bytesRead,
      &bytesWritten,
      portMAX_DELAY
    );
    if (writeErr != ESP_OK || bytesWritten == 0) break;

    remaining -= min((uint32_t)bytesRead, (uint32_t)bytesWritten);
  }

  file.close();
  return true;
}

void audioTask(void* parameter) {
  (void)parameter;

  for (;;) {
    // ======================================================
    // LITTLEFS OTA PAUSE
    // ======================================================
    // Khi onStart() yêu cầu pause, playback hiện tại đã được yêu cầu thoát
    // và đóng File. Tới đây task gửi silence rồi xác nhận an toàn để callback
    // có thể LittleFS.end(). Trong suốt OTA filesystem không đọc/ghi audio.
    if (audioFsOtaPauseRequested) {
      if (!audioFsOtaPaused) {
        writeAudioSilence();
        audioFsOtaPaused = true;
      }

      while (audioFsOtaPauseRequested) {
        vTaskDelay(pdMS_TO_TICKS(10));
      }

      audioFsOtaPaused = false;
      continue;
    }

    // 1) Beep nút luôn ưu tiên cao hơn voice đang chờ.
    uint8_t beepToken = 0;
    if (audioBeepQueue != nullptr && xQueueReceive(audioBeepQueue, &beepToken, 0) == pdTRUE) {
      playButtonBeepInternal();
      continue;
    }

    // 2) Voice sự kiện quan trọng.
    const char* voicePath = nullptr;
    if (audioVoiceQueue != nullptr &&
        xQueueReceive(audioVoiceQueue, &voicePath, pdMS_TO_TICKS(20)) == pdTRUE) {
      playVoiceWavInternal(voicePath);
      continue;
    }

    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

void detachServoSafe(int index) {
  usbServos[index].detach();                
  pinMode(USB_SERVO_PINS[index], OUTPUT);   
  digitalWrite(USB_SERVO_PINS[index], LOW); 
}
